% 三自由度机器人手臂动力学方程推导
% 方法：牛顿欧拉方程
% 第一部分是对每个连杆应用牛顿欧拉方程，从连杆1到连杆3向外迭代计算连杆的速度和加速度
% 第二部分是从连杆3到连杆1向内迭代计算连杆间的相互作用力和力矩以及关节驱动力矩

%第一部分
%外推，0 --》2，求F11 F22 F33 N11 N22 N33 即腰部、大臂和小臂在运动过程中所收到的惯性力和惯性力矩在各自连杆坐标系下的表示
% 在此规定，如F11，第一数字表示关节（字母右下角的数字），第二个数字表示参考坐标系（即字母左上角的数字）
% 地面规定为0杆，腰部是1杆，大臂是2杆，小臂是3杆
%已知 ： 
%        W（角速度） W00、W11、W22、W33 各个关节的角速度在各自关节坐标系下的表示，其中W00=0，表示0杆的角速度
%       dW（角速度） dW00、dW11、dW22、dW33 各个关节的角加速度在各自关节坐标系下的表示，其中dW00=0，表示0杆的角加速度



%数据准备
% 机器人前运动学
%clear variables; close all; clc;
% syms theta1 theta2 theta3 dtheta1 dtheta2 dtheta3 ddtheta1 ddtheta2 ddtheta3
% theta1=0; theta2=0; theta3=0; dtheta1=0; dtheta2=0; dtheta3=0; ddtheta1=0; ddtheta2=0; ddtheta3=0;
function [F_inertia, Torqu_inertia] = Compute_Inertia_force(theta, dtheta, ddtheta)
%theta4 = 0;%只考虑前三个关节的运动
a2 = 1.300; d4 = 1.400 + 0.32545;%(增加了手腕的长度）

theta1 = theta(1);     theta2 = theta(2);    theta3 = theta(3);
dtheta1 = dtheta(1);   dtheta2 = dtheta(2);   dtheta3 = dtheta(3);
ddtheta1 = ddtheta(1); ddtheta2 = ddtheta(2); ddtheta3 = ddtheta(3);


T01 = Chuandi_matrix(0, 0, 0, theta1);
T12 = Chuandi_matrix(pi/2, 0, 0, theta2+pi/2);
T23 = Chuandi_matrix(0, a2, 0, theta3);
% T34 = Chuandi_matrix(pi/2, 0, d4, theta4);


T02 = T01*T12;
T03 = T02*T23;



R10 = inv(T01(1:3,1:3));
R21 = inv(T12(1:3,1:3));
R32 = inv(T23(1:3,1:3));
% R43 = inv(T34(1:3,1:3));

% R01 = T01(1:3,1:3);
% R12 = T12(1:3,1:3);
% R23 = T23(1:3,1:3);
% R34 = T34(1:3,1:3);

R01 = T01(1:3,1:3);
R02 = T02(1:3,1:3);
R03 = T03(1:3,1:3);


Wi_1_i_1 = zeros(3,4);                            %4x4的矩阵，每一列是一个关节的角速度值,中间迭代得到的值
Ri_1_i = [R10 R21 R32];                           %9x3的矩阵，每三列是一个转换矩阵，坐标系i向坐标系i+1转换的矩阵， 与theta1、theta2、theta3相关的值
dTheta_Z = [0         0         0;
            0         0         0;
            dtheta1   dtheta2   dtheta3];         % 3x3矩阵，与dtheta1、dtheta2、dtheta3相关的值
ddTheta_Z = [0         0         0;
            0         0         0;
            ddtheta1   ddtheta2   ddtheta3];      % 3x3矩阵，与ddtheta1、ddtheta2、ddtheta3相关的值
dWi_1_i_1 = zeros(3,4);                           %4x4的矩阵，每一列是一个关节的角加速度值,中间迭代得到的值
dVi_1_i_1 = zeros(3,4);                           %4x4的矩阵, 每一列是各个关节坐标系原点速度在该关节坐标系下的表示,中间迭代得到的值
dVci_1_i_1 = zeros(3,3);                          %3x3矩阵,,中间迭代得到的值



p_0_1 = [0; 0; 0];
p_1_2 = [0; 0; 0];
p_2_3 = [a2; 0; 0];
p_3_4 = [0; -d4; 0];
P_i_i_1 = [p_0_1 p_1_2 p_2_3 p_3_4];               %3x3矩阵,后一关节坐标系原点在前一关节坐标系中的表示

pc_1_1 = [0.00432487;    0.02175752;  -0.14610868];
pc_2_2 = [0.69671991;   -0.00002796;  -0.33729352];
pc_3_3 = [0.00108968;   -0.64843688;  -0.06445674];
Pc_i_1_i_1 = [pc_1_1 pc_2_2 pc_3_3];              %3x3矩阵,各自杆件重心在相应关节坐标系下的表示

Mass = [ 257.27572822  78.58091036  82.07360471]; %1x3矩阵，每一列表示各个杆件的质量(kg)

ic_1_1 = [14.69456709	 0.03759401	     0.48456749;
           0.03759401	 15.18045512	 1.45529757;
           0.48456749	 1.45529757	     10.21186812];

ic_2_2 =  [1.52652020	  0.00166613	 -0.62055765;
	       0.00166613	  17.30298693	 -0.00018962;
	      -0.62055765	 -0.00018962	  17.88315815];

ic_3_3 = [29.21789693      -0.11092593	  0.00976189
	     -0.11092593	    1.39944788	 -1.69869267
	      0.00976189	   -1.69869267	  29.41235765];

Ic_i_1_i_1 = [ic_1_1 ic_2_2 ic_3_3];                      %9x3矩阵，每三列表示各个杆件在质心坐标系下的杆件的转动惯量

Fi_1_i_1 = zeros(3,3);                                    %3x3矩阵， 每一列表示各个杆件运动中所受惯性力大小在各自关节坐标系下的表示,中间迭代得到的值
N_torque = zeros(3,3);                                    %3x3矩阵，每一列表示各个杆件在运动过程中所受惯性力矩的大小,中间迭代得到的值



for i = 1:1:3    % 在此为了矩阵表示方便，将0-2写成1-3
    Wi_1_i_1(:,i+1)  = Ri_1_i(:,3*i-2:3*i) * Wi_1_i_1(:,i) + dTheta_Z(:,i);   %第一列是0杆
    dWi_1_i_1(:,i+1) = Ri_1_i(:,3*i-2:3*i) * dWi_1_i_1(:,i) + cross( Ri_1_i(:,3*i-2:3*i) * Wi_1_i_1(:,i), dTheta_Z(:,i)) + ddTheta_Z(:,i);
    dVi_1_i_1(:,i+1) = Ri_1_i(:,3*i-2:3*i) * (cross(dWi_1_i_1(:,i), P_i_i_1(:,i)) + cross(Wi_1_i_1(:,i), cross(Wi_1_i_1(:,i),P_i_i_1(:,i))) + dVi_1_i_1(:,i));
    dVci_1_i_1(:,i) = cross(dWi_1_i_1(:,i+1), Pc_i_1_i_1(:,i)) + cross(Wi_1_i_1(:,i+1), cross(Wi_1_i_1(:,i+1), Pc_i_1_i_1(:,i))) + dVi_1_i_1(:,i+1);
    Fi_1_i_1(:,i) = Mass(:,i) * dVci_1_i_1(:,i);
    N_torque(:,i) = Ic_i_1_i_1(:,3*i-2:3*i) * dWi_1_i_1(:,i+1) + cross(Wi_1_i_1(:,i+1), Ic_i_1_i_1(:,3*i-2:3*i) * Wi_1_i_1(:,i+1));
    
end
% %第二部分
% % 内推
% fi_i = zeros(3,4);             %4x4矩阵，每一列是各个关节处所受的相互作用力
% Ri_i_1 = [R12 R23 R34];        %9x3的矩阵，每三列是一个转换矩阵，坐标系i+1向坐标系i转换的矩阵
% ni_i = zeros(3,4);             %4x4矩阵，每一列是各个关节处所受的相互作用力矩
% Zi_i = [0; 0; 1];
% Ti = zeros(1,3);                       %1x3矩阵
% 
% for i_2 = 3:-1:1
%     fi_i(:,i_2) = Ri_i_1(:,3*i_2-2:3*i_2) * fi_i(:,i_2+1) + Fi_1_i_1(:,i_2);
%     ni_i(:,i_2) = N_torque(:,i_2) + Ri_i_1(:,3*i_2-2:3*i_2) * ni_i(:,i_2+1) + cross(Pc_i_1_i_1(:,i_2), Fi_1_i_1(:,i_2)) + cross(P_i_i_1(:,i_2+1), Ri_i_1(:,3*i_2-2:3*i_2) * fi_i(:,i_2+1));
%     Ti(:,i_2) = (ni_i(:,i_2))' * Zi_i;
% end
    
    



% 第二部分：
% 由第一部分得到了各个杆件在运动过程中的惯性力和惯性力矩相对于各自关节坐标系的大小，为了在abaqus中进行受力分析，需要将相应的力和力矩的方向转换到与固定坐标系一致
% 惯性力 Fi_1_i_1 惯性力矩 N_torque
F0_1 = R01*Fi_1_i_1(:,1);                %腰部所受惯性力大小在固定坐标系axis_0下的表示
F0_2 = R02*Fi_1_i_1(:,2);                %大臂所受惯性力大小在固定坐标系axis_0下的表示
F0_3 = R03*Fi_1_i_1(:,3);                %小臂所受惯性力大小在固定坐标系axis_0下的表示



%上述求得到惯性力的单位为kg.m/s^2, 惯性力矩的单位为kg.m^2/s^2,应转换为t.mm^2/s^2
N_torque_0_1 = R01*N_torque(:,1)*1000;        %腰部所受惯性力矩大小在固定坐标系axis_0下的表示
N_torque_0_2 = R02*N_torque(:,2)*1000;        %大臂所受惯性力矩大小在固定坐标系axis_0下的表示
N_torque_0_3 = R03*N_torque(:,3)*1000;        %小臂所受惯性力矩大小在固定坐标系axis_0下的表示



F_inertia = [F0_1 F0_2 F0_3];                                       %3x3 矩阵，每一列是相应杆件所受惯性力在xyz三个方向上的大小
Torqu_inertia = [N_torque_0_1 N_torque_0_2 N_torque_0_3];           %3x3 矩阵，每一列是相应杆件所受惯性力矩在xyz三个方向上的大小


 